// Напишите программу, которая принимает на вход цифру, обозначающую день недели, 
// и проверяет, является ли этот день выходным.

Console.Write("Введите номер дня недели от 1 до 7:  ");
string day = Console.ReadLine();
switch (day)
{
    case "1":
    {
        Console.Write("будний день");
        break;
    }
    case "2":
    {
        Console.Write("будний день");
        break;
    }
    case "3":
    {
        Console.Write("будний день");
        break;
    }
    case "4":
    {
        Console.Write("будний день");
        break;
    }
    case "5":
    {
        Console.Write("будний день");
        break;
    }
    case "6":
    {
        Console.Write("выходной день");
        break;
    }
    case "7":
    {
        Console.Write("выходной день");
        break;
    }
}

